<template>
  <div>
    <div v-for="item in itemForm"
         :key="item.id">
      <list-item :itemForm='item'></list-item>
    </div>
  </div>
</template>

<script>
import ListItem from '@/components/ListItem'
export default {
  data() {
    return {
      itemForm: [
        {
          id: '1',
          user: '旅游爱好者',
          itemTitle: '旅游书中鲜少提及，这座面积不足重庆1/3的欧洲小国很有料',
          textContent:
            '你好！仓储管理，非常细化，涉及到方方面面。想要提高仓储管理的效率，需要系统化地去解决。接下来，简单分享几点：你好！ 仓储管理，非常细化，涉及到方方面面。想要提高仓储管理的效率，需要系统化地去解决。接下来，简单分享几点： 01 组织结构 现阶段的大部分仓库，自动',
          date: '04-16',
        },
        {
          id: '2',
          user: '想去前端',
          itemTitle: '27岁转行去学前端现在在北京实际么？',
          textContent:
            ' 实话告诉你，培训机构是不负责培养所谓自制力的！题主的情况，大概是转行前端的意向不够强烈，导致自驱力不足，这种情况不建议盲目报班，先想清楚，自己是不是要做前端，做程序员，务必是要终身学习的，尤其前端，新的知识层出不穷，没有良好的自制力，学习规划，恐怕再这条路走不远，培训机构的意义主要是带你入门，找到第一份工作而已，上班就业是一个新的开始……无论题主要来北京学前端也好，去上海学前端也罢，报培训班就是应该多家试听对比，选择性价比最高的，讲课最好的一家，丁鹿学堂自成立以来始终专注web前端就业培训，试听考察不收任何费用，报前端培训课程，建议试听过丁鹿学堂的课程再做决策',
          date: '07-18',
        },
        {
          id: '3',
          user: '攻城狮',
          itemTitle:
            '为什么JVM要使用双亲委派模型，以及为什么要使用多个类加载器？',
          textImg:
            'https://pic4.zhimg.com/50/v2-618cdac6fd827859a78c0a305d518da1_400x224.jpg',
          textContent:
            ' 这个用我们常用的Tomat类加载器回答是再合适不过了！ 类加载器这块，总的来说吧，就两大知识点 1.双亲委派 2.以此引申扩展的Tomcat类加载器的实现 最后是一个小感触，和大家聊一个童话故事吧~！ 话说，从前有只小脑斧向一只小花猫学本领。。。',
          date: '07-16',
        },
        {
          id: '4',
          user: '',
          itemTitle: '何采用教师现场授课这种效率低成本高的方式来传递知识？',
          textContent:
            ' 我们教师曾经讨论过如何让其他行业的人知道教学的艰辛，讨论的结果是，让其他人尝试教家里70岁老人（文盲更好）使用微信即可。 不仅要现场授课，还要一遍遍的,z我们教师曾经讨论过如何让其他行业的人知道教学的艰辛，讨论的结果是，让其他人尝试教家里70岁老人（文盲更好）使用微信即可。 不仅要现场授课，还要一遍遍的我们教师曾经讨论过如何让其他行业的人知道教学的艰辛，讨论的结果是，让其他人尝试教家里70岁老人（文盲更好）使用微信即可。 不仅要现场授课，还要一遍遍的我们教师曾经讨论过如何让其他行业的人知道教学的艰辛，讨论的结果是，让其他人尝试教家里70岁老人（文盲更好）使用微信即可。 不仅要现场授课，还要一遍遍的',
        },
        {
          id: '5',
          user: '薛老板',
          itemTitle: '了解产品经理的分类，这一个视频就够了',
          textImg:
            'https://pica.zhimg.com/v2-392bdeff9daef78afe343b8424eff65b_400x224.jpg?source=382ee89a',
          textContent:
            ' 策略产品、数据产品、功能产品、增长产品、商业产品不知道怎么区分？不知道怎么选？这个视频包你了解透彻',
        },
      ],
    }
  },
  components: {
    ListItem,
  },
}
</script>

<style lang="less" scoped>
</style>